Revit 2026 API

# ProfileFailures Properties

---

The BuiltInFailuresProfileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchNotEmpty | Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time. |

#### Reference

BuiltInFailuresProfileFailures Class

Autodesk.Revit.DB Namespace